Revit 2027 API
Opening.BoundaryCurves Property
 The geometry information for non-rectangular openings in project documents, or for all openings in family documents.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveArray BoundaryCurves { get; }
Public ReadOnly Property BoundaryCurves As CurveArray
	Get
public:
property CurveArray^ BoundaryCurves {
	CurveArray^ get ();
}
member BoundaryCurves : CurveArray with get
Property Value
CurveArray
Remarks
If IsRectBoundary is true, this value is null.
See Also
Reference
Opening Class
Autodesk.Revit.DB Namespace